---
kind: type
id: T:Autodesk.Revit.DB.CurtainGridSetIterator
source: html/b8aa3f5a-d84c-a10b-34a0-4562c2fc2ed3.htm
---
# Autodesk.Revit.DB.CurtainGridSetIterator

An iterator to a set.

## Syntax (C#)
```csharp
public abstract class CurtainGridSetIterator : APIObject,
	IEnumerator
```